spec/cassettes/deactivate_user_on_charing_failed/deactivates_the_user_with_the_webhook_data_from_stripe_for_a_charge_failed.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_15yZX9Hm1LsTwnnZznC1xDZB
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.21.0
      Authorization:
      - Bearer sk_test_N3kN90bAJxy1fhanixorOQ1v
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.21.0","lang":"ruby","lang_version":"2.0.0 p598 (2014-11-13)","platform":"x86_64-darwin14.0.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        DanielTseng.local 14.3.0 Darwin Kernel Version 14.3.0: Mon Mar 23 11:59:05
        PDT 2015; root:xnu-2782.20.48~5/RELEASE_X86_64 x86_64","hostname":"DanielTseng.local"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 04 May 2015 03:37:42 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2625'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - '*'
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_xAwymTLfOuy1gG1S
      Stripe-Version:
      - '2014-08-04'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_15yZX9Hm1LsTwnnZznC1xDZB",
          "created": 1430707335,
          "livemode": false,
          "type": "charge.failed",
          "data": {
            "object": {
              "id": "ch_15yZX8Hm1LsTwnnZP8p6mnRR",
              "object": "charge",
              "created": 1430707334,
              "livemode": false,
              "paid": false,
              "status": "failed",
              "amount": 999,
              "currency": "usd",
              "refunded": false,
              "source": {
                "id": "card_15yZVyHm1LsTwnnZp6dDfPha",
                "object": "card",
                "last4": "0341",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 5,
                "exp_year": 2017,
                "fingerprint": "hSdDiLlDMKgGgVqd",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "dynamic_last4": null,
                "metadata": {},
                "customer": "cus_6AvKHwE9z0BJB4"
              },
              "captured": false,
              "card": {
                "id": "card_15yZVyHm1LsTwnnZp6dDfPha",
                "object": "card",
                "last4": "0341",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 5,
                "exp_year": 2017,
                "fingerprint": "hSdDiLlDMKgGgVqd",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "dynamic_last4": null,
                "metadata": {},
                "customer": "cus_6AvKHwE9z0BJB4"
              },
              "balance_transaction": null,
              "failure_message": "Your card was declined.",
              "failure_code": "card_declined",
              "amount_refunded": 0,
              "customer": "cus_6AvKHwE9z0BJB4",
              "invoice": null,
              "description": "",
              "dispute": null,
              "metadata": {},
              "statement_descriptor": null,
              "fraud_details": {},
              "receipt_email": null,
              "receipt_number": null,
              "shipping": null,
              "application_fee": null,
              "refunds": {
                "object": "list",
                "total_count": 0,
                "has_more": false,
                "url": "/v1/charges/ch_15yZX8Hm1LsTwnnZP8p6mnRR/refunds",
                "data": []
              },
              "statement_description": null
            }
          },
          "object": "event",
          "pending_webhooks": 1,
          "request": "iar_6AvNU5nf6Mp3AZ",
          "api_version": "2014-08-04"
        }
    http_version: 
  recorded_at: Mon, 04 May 2015 03:37:42 GMT
recorded_with: VCR 2.9.3
